namespace AStartAlgorithm.Additional
{
    public static class Constants
    {
        public static string[,] matrix1 =           //стандарт
       {
            {"%","%", "%", "%", "%", "%", "%"},
            {"%"," ", " ", " ", " ", "E", "%"},
            {"%","%", " ", "%", "%", " ", "%"},
            {"%"," ", " ", "S", "%", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", " ", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", " ", " ", "%"},
            {"%","%", "%", "%", "%", "%", "%"},
        };

        public static string[,] matrix2 =           //нет пути
          {
            {"%","%", "%", "%", "%", "%", "%"},
            {"%"," ", " ", " ", "%", "E", "%"},
            {"%","%", " ", "%", "%", "%", "%"},
            {"%"," ", " ", "S", "%", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", " ", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", "%", " ", "%"},
            {"%"," ", " ", " ", " ", " ", "%"},
            {"%","%", "%", "%", "%", "%", "%"},
        };

        public static Route[] routes =
        {
            new Route("Top",(-1,0)),
            new Route("Right",(0,1)),
            new Route("Down",(1, 0)),
            new Route("Left",(0, -1))
        };

        public static Route[] routesReverse =
        {
            new Route("FromDown",(-1,0)),
            new Route("FromLeft",(0,1)),
            new Route("FromTop",(1, 0)),
            new Route("FromRight",(0, -1))
        };
    }
}
